Revit 2027 API
FabricationPartJustification Enumeration
 Fabrication part eccentric justifications for alignment for flat edged parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationPartJustification
Public Enumeration FabricationPartJustification
public enum class FabricationPartJustification
type FabricationPartJustification
Members
Member name | Value | Description
Bottom | 1 |  Outside edge justification to the bottom
Middle | 0 |  Default middle justification to the connector
Top | 2 |  Outside edge justification to the top
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace